Tekla Open API Reference for Tekla Structures 2025
ModelObjectSelector Constructor
 Creates a new model object selector instance.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectSelector()
Public Sub New
See Also
Reference
ModelObjectSelector Class
Tekla.Structures.Model.UI Namespace